#!/bin/bash
clear
agafanoms=`cat ELNOM.txt`
buclepower=1
while [ $buclepower -eq 1 ]
do
	clear
	echo -e "\e[0;1m______________________________________________________________________________________________________________________________________\e[0;00m\n"
	echo -e "\e[0;34m___________________________________________________________\e[0m \e[1;34m1. Information\e[0m \e[0;34m___________________________________________________________\e[0m"	
	echo
	echo -e "\e[0;32m_______________________________________________________________\e[0m \e[1;32m2. Shop\e[0m \e[0;32m______________________________________________________________\e[0m"
	echo	
	echo -e "\e[0;36m______________________________________________________________\e[0m \e[1;36m3. Powers\e[0m \e[0;36m_____________________________________________________________\e[0m"
	echo
	echo -e "\e[0;31m_______________________________________________________________\e[0m \e[1;31m4. Exit\e[0m \e[0;31m______________________________________________________________\e[0m"
	echo
	echo -e "\e[0;35m_______________________________________________________________\e[0m \e[1;35m5. Play\e[0m \e[0;35m______________________________________________________________\e[0m"
	echo
	echo -e "\e[0;1m______________________________________________________________________________________________________________________________________\e[0;00m\n"
	read eleccio
	case $eleccio in 
			1)
			vida=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 7`
			mana=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 8`
			xp=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 6`
			rp=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 9`
			nom=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 2`
			equip=`cat usuaris.txt | grep -w ^$agafanoms | cut -d " " -f 4`
			MiVida=`echo -e "\e[0;31m____________________________________________________________\e[0m \e[1;31mCurrent Health:$vida\e[0m "`
			echo -n "$MiVida"
			BarraVida=`cat LaBarraVidaHeal.txt | grep -w ^$vida | cut -d " " -f 2`
			echo -e " \e[0;31m$BarraVida\e[0m "
			echo                       
			manavista=`echo -e "\e[0;34m_____________________________________________________________\e[0m \e[1;34mCurrent Mana:$mana\e[0m"`
			echo -n "$manavista"
			BarraMana=`cat LaBarraManaHeal.txt | grep -w ^$mana | cut -d " " -f 2`
			echo -e " \e[0;34m$BarraMana\e[0m "
			echo                               
			echo -e "\e[0;33m______________________________________________________________\e[0m \e[1;33mCurrent XP:$xp\e[0m \e[0;33m___________________________________________________________\e[0m"
			echo			
			echo -e "\e[0;30m______________________________________________________________\e[0m \e[1;30mCurrent RP:$rp\e[0m \e[0;30m___________________________________________________________\e[0m"  
			echo                    
			echo -e "\e[0;35m_________________________________________________________________\e[0m \e[1;35mName:$nom\e[0m \e[0;35m______________________________________________________\e[0m"
			echo                                      
			echo -e "\e[1;36m_________________________________________________________________\e[0m \e[1;36mTeam:$equip\e[0m \e[1;36m______________________________________________________________\e[0m"                                                           
			echo " 
                    _,.-······-._
                  ,·             ·._
                ,º   ..     .       ·.
              .º     ||     ||        ·._
   ,.....---º·                         ·._º-..._
   º._  _,.-·/        ºº--º         º  º. º._   ººº-.
  __..-º   ,º /                      \   º.  º-.__.-º
º._    __,º  ,                        º.   º.    º--.
   ººº.º   .º       _..+..              º.   º.-...-º
    ,º  _,º     _.-º   A  º-._            º._  º-.
    ºº+º       º     ,º º     º-             ººº-º
      º            ,º ___º.                   |
     .            º .º   º.º.                 |  _,.
     |            ,º       º                  |,º ,º
     |           /          \                 |  /
     |          j            º                | /
     |          |------------|                |/
      .         |            |               ,º
       º.        \          /              ,º
         º._      º._     ,º             .º
            º._      ººººº             .º
          _,º  º-.....___________...-ºº-.
         º...---º               º--.....-º"
			echo -n "Pulsa Intro....."
	                read jhfsa 
			;;
			2)
			./Tenda.sh
			;;
			3)
			./heal.sh
			;;
			4)
			buclepower=2
			;;
			5)
			./Snake.sh
			;;
			*)
			echo "Pero MADREMIA ESQUE NO SAS LLEGIR CASURRO EN CAP DE PLAT DE BLEDES"
			read fdehjgfbeshgaberjgberhg
			;;
	esac
done
./Classcraft.sh
